resources/pageObjects/s

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tsp="http://ouaf.oracle.com/webservices/c1/TSProcessRegistrationForm">
   <soapenv:Header/>
   <soapenv:Body>
      <tsp:TSProcessRegistrationForm>
         <tsp:head>
            <tsp:action>?</tsp:action>
            <tsp:key1>
  <tsp:name>?</tsp:name>
  <tsp:value>?</tsp:value>
            </tsp:key1>
            <tsp:key2>
  <tsp:name>?</tsp:name>
  <tsp:value>?</tsp:value>
            </tsp:key2>
            <tsp:key3>
  <tsp:name>?</tsp:name>
   
  <tsp:value>?</tsp:value>
            </tsp:key3>

            <tsp:key4>
   
  <tsp:name>?</tsp:name>
   
  <tsp:value>?</tsp:value>
            </tsp:key4>

            <tsp:key5>
   
  <tsp:name>?</tsp:name>
   
  <tsp:value>?</tsp:value>
            </tsp:key5>

            <tsp:key6>
   
  <tsp:name>?</tsp:name>
   
  <tsp:value>?</tsp:value>
            </tsp:key6>

            <tsp:key7>
   
  <tsp:name>?</tsp:name>
   
  <tsp:value>?</tsp:value>
            </tsp:key7>

            <tsp:key8>
   
  <tsp:name>?</tsp:name>
   
  <tsp:value>?</tsp:value>
            </tsp:key8>

            <tsp:key9>
   
  <tsp:name>?</tsp:name>
   
  <tsp:value>?</tsp:value>
            </tsp:key9>

            <tsp:key10>
   
  <tsp:name>?</tsp:name>
   
  <tsp:value>?</tsp:value>
            </tsp:key10>

            <tsp:webUserId>?</tsp:webUserId>

            <tsp:webUserName>?</tsp:webUserName>

            <tsp:emailAddress>?</tsp:emailAddress>

            <tsp:ipAddress>?</tsp:ipAddress>

            <tsp:accessType>?</tsp:accessType>
         </tsp:head>
          
         <tsp:requestStatus>?</tsp:requestStatus>
          
         <tsp:errorMessage>

            <tsp:messageCategory>?</tsp:messageCategory>

            <tsp:messageNumber>?</tsp:messageNumber>

            <tsp:messageParameters>
  <!--Zero or more repetitions:-->
  <tsp:parameters>
      
     <tsp:sequence>?</tsp:sequence>
      
     <tsp:parameterType>?</tsp:parameterType>
      
     <tsp:parameterValue>?</tsp:parameterValue>
  </tsp:parameters>
            </tsp:messageParameters>

            <tsp:currency>?</tsp:currency>

            <tsp:messageTxtOvrd>?</tsp:messageTxtOvrd>

            <tsp:messageReference>?</tsp:messageReference>
         </tsp:errorMessage>
          
         <tsp:confirmationData>

            <tsp:confirmationId>?</tsp:confirmationId>

            <tsp:header>
   
  <tsp:messageCategory>?</tsp:messageCategory>
   
  <tsp:messageNumber>?</tsp:messageNumber>
   
  <tsp:messageParameters>
     <!--Zero or more repetitions:-->
     <tsp:parameters>
         
        <tsp:sequence>?</tsp:sequence>
         
        <tsp:parameterType>?</tsp:parameterType>
         
        <tsp:parameterValue>?</tsp:parameterValue>
     </tsp:parameters>
  </tsp:messageParameters>
   
  <tsp:currency>?</tsp:currency>
   
  <tsp:messageTxtOvrd>?</tsp:messageTxtOvrd>
            </tsp:header>
            <!--Zero or more repetitions:-->
            <tsp:details>
   
  <tsp:sequence>?</tsp:sequence>
   
  <tsp:messageCategory>?</tsp:messageCategory>
   
  <tsp:messageNumber>?</tsp:messageNumber>
   
  <tsp:messageParameters>
     <!--Zero or more repetitions:-->
     <tsp:parameters>
         
        <tsp:sequence>?</tsp:sequence>
         
        <tsp:parameterType>?</tsp:parameterType>
         
        <tsp:parameterValue>?</tsp:parameterValue>
     </tsp:parameters>
  </tsp:messageParameters>
   
  <tsp:currency>?</tsp:currency>
   
  <tsp:messageTxtOvrd>?</tsp:messageTxtOvrd>
            </tsp:details>
         </tsp:confirmationData>
          
         <tsp:linkedRequest>?</tsp:linkedRequest>
          
         <tsp:mainData>

            <tsp:validationRule>?</tsp:validationRule>

            <tsp:validationServer>?</tsp:validationServer>

            <tsp:formType>?</tsp:formType>

            <tsp:formCategory>?</tsp:formCategory>
            <!--Zero or more repetitions:-->
            <tsp:customProperties>
   
  <tsp:sequence>?</tsp:sequence>
   
  <tsp:propertyName>?</tsp:propertyName>
   
  <tsp:value>?</tsp:value>
            </tsp:customProperties>

            <tsp:responseMode>?</tsp:responseMode>

            <tsp:documentLocator>?</tsp:documentLocator>

            <tsp:formData>
   
  <tsp:id>?</tsp:id>
   
  <tsp:name>?</tsp:name>
  <!--Zero or more repetitions:-->
  <tsp:section>
      
     <tsp:id>?</tsp:id>
      
     <tsp:name>?</tsp:name>
      
     <tsp:sequence>?</tsp:sequence>
     <!--Zero or more repetitions:-->
     <tsp:line>
         
        <tsp:field>
            
           <tsp:id>?</tsp:id>
            
           <tsp:name>?</tsp:name>
            
           <tsp:dataType>?</tsp:dataType>
            
           <tsp:value>?</tsp:value>
        </tsp:field>
     </tsp:line>
     <!--Zero or more repetitions:-->
     <tsp:table>
         
        <tsp:id>?</tsp:id>
         
        <tsp:name>?</tsp:name>
        <!--Zero or more repetitions:-->
        <tsp:tableRow>
            
           <tsp:sequence>?</tsp:sequence>
           <!--Zero or more repetitions:-->
           <tsp:field>
  
 <tsp:id>?</tsp:id>
  
 <tsp:name>?</tsp:name>
  
 <tsp:dataType>?</tsp:dataType>
  
 <tsp:value>?</tsp:value>
           </tsp:field>
        </tsp:tableRow>
     </tsp:table>
  </tsp:section>
            </tsp:formData>

            <tsp:exceptions>
  <!--Zero or more repetitions:-->
  <tsp:exception>
      
     <tsp:sequence>?</tsp:sequence>
      
     <tsp:elementReference>?</tsp:elementReference>
      
     <tsp:errorMessage>
         
        <tsp:messageCategory>?</tsp:messageCategory>
         
        <tsp:messageNumber>?</tsp:messageNumber>
         
        <tsp:messageParameters>
           <!--Zero or more repetitions:-->
           <tsp:parameters>
  
 <tsp:sequence>?</tsp:sequence>
  
 <tsp:parameterType>?</tsp:parameterType>
  
 <tsp:parameterValue>?</tsp:parameterValue>
           </tsp:parameters>
        </tsp:messageParameters>
         
        <tsp:currency>?</tsp:currency>
         
        <tsp:messageTxtOvrd>?</tsp:messageTxtOvrd>
         
        <tsp:messageReference>?</tsp:messageReference>
     </tsp:errorMessage>
  </tsp:exception>
            </tsp:exceptions>
         </tsp:mainData>
         <!--Zero or more repetitions:-->
         <tsp:customInfo>

            <tsp:sequence>?</tsp:sequence>

            <tsp:fieldName>?</tsp:fieldName>

            <tsp:fieldValue>?</tsp:fieldValue>
         </tsp:customInfo>
      </tsp:TSProcessRegistrationForm>
   </soapenv:Body>
</soapenv:Envelope>